<a href="https://colab.research.google.com/github/a1978952/BarabaraGame/blob/master/A1978952Py13_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn import metrics

In [4]:
data = pd.read_csv('dia.csv',encoding = 'shift-jis')
data

                  datetime  patient_id  code  value
0      1988-03-27 08:00:00          68    58      1
1      1988-03-27 08:00:00          68    34      0
2      1988-03-27 12:00:00          68    60      1
3      1988-03-27 18:00:00          68    62      2
4      1988-03-28 08:00:00          68    58      1
...                    ...         ...   ...    ...
29037  1991-09-23 12:15:00          20    60      0
29038  1991-09-23 17:15:00          20    62      2
29039  1991-09-23 17:15:00          20    33      0
29040  1991-09-23 21:10:00          20    48      2
29041  1991-09-23 21:10:00          20    33      0

[29042 rows x 4 columns]

In [5]:
data.head()

              datetime  patient_id  code  value
0  1988-03-27 08:00:00          68    58      1
1  1988-03-27 08:00:00          68    34      0
2  1988-03-27 12:00:00          68    60      1
3  1988-03-27 18:00:00          68    62      2
4  1988-03-28 08:00:00          68    58      1

In [6]:
x = data[['code', 'patient_id']]  
x

       code  patient_id
0        58          68
1        34          68
2        60          68
3        62          68
4        58          68
...     ...         ...
29037    60          20
29038    62          20
29039    33          20
29040    48          20
29041    33          20

[29042 rows x 2 columns]

In [7]:
y = data['value']  
y

0        1
1        0
2        1
3        2
4        1
        ..
29037    0
29038    2
29039    0
29040    2
29041    0
Name: value, Length: 29042, dtype: int64

In [8]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.2)
model =  DecisionTreeClassifier()
model.fit(x_train, y_train)
y_pred = model.predict(x_test) 
y_pred

array([0, 2, 0, ..., 0, 0, 1])

In [9]:
from sklearn.metrics import accuracy_score
acc = accuracy_score(y_test,y_pred)
acc

0.7686348769151317